flashCardsAPI/flashcardsapi/app/controllers/api/v1/flashcards_controller.rb

SELECT "flashcards".* FROM "flashcards"
---
  def index
    flashcards = Flashcard.all

INSERT INTO "flashcards" ("subject", "question", "answer", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["subject", "test"], ["question", "test"], ["answer", "test"], ["created_at", "2017-05-25 13:53:57.477760"], ["updated_at", "2017-05-25 13:53:57.477760"]]
---
  def create
    flashcard = Flashcard.create(flashcard_params)

SELECT  "flashcards".* FROM "flashcards" WHERE "flashcards"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
DELETE FROM "flashcards" WHERE "flashcards"."id" = ?  [["id", 8]]
---
  def destroy
    flashcard = Flashcard.find(params[:id])
    flashcard.destroy